app/views/users/show.html.haml


- if @user.streams.any?
---
SELECT "streams".* FROM "streams" WHERE "streams"."user_id" = ?  [["user_id", 10]]
SELECT 1 AS one FROM "streams" WHERE "streams"."user_id" = ? LIMIT 1  [["user_id", 7]]