app/views/streams/_form.html.haml

SELECT DISTINCT "movies".* FROM "movies" WHERE (available = 't')
---
    = f.label :movie_id, "Pelicula"
    = f.collection_select :movie_id, Movie.where("available = ?",true).distinct, :id, :title,{}