app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres" ORDER BY "genres"."title" ASC
---
	def index
    @genres = Genre.order(title: :asc)

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "genres" SET "title" = ?, "updated_at" = ? WHERE "genres"."id" = 3  [["title", "Drama 3"], ["updated_at", Sat, 21 Mar 2015 23:34:58 UTC +00:00]]
---
  def update
    @genre = Genre.find(params[:id])

    if @genre.update(genre_params)