app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY "movies"."released_at" DESC
---
	def index
    @movies = Movie.order(released_at: :desc)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "movies" SET "available" = ?, "updated_at" = ? WHERE "movies"."id" = 11  [["available", false], ["updated_at", Sun, 22 Mar 2015 04:06:50 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)