app/controllers/sessions_controller.rb

  def create
  	email = params[:session][:email]
    pass = params[:session][:password]

    @user = User.find_by_email(email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'cyber_heroe@unitec.edu' LIMIT 1