app/controllers/streams_controller.rb

  def index
    @movie = Movie.find(params[:movie_id])
    @streams = @movie.streams.order(created_at: :desc)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "streams".* FROM "streams" WHERE "streams"."movie_id" = ? ORDER BY "streams"."created_at" DESC  [["movie_id", 9]]

  def new

    if current_user.id.to_i != params[:user_id].to_i
      redirect_to user_path(current_user)
      return
    end
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]