app/controllers/users_controller.rb

  def show
    @user = User.find(current_user.id)
    @streams = @user.streams
    #@streams = Stream.includes(:movie)

    if params[:keyword].present?
      q = params[:keyword]
      #@streams = @streams.joins(:movie).where("streams.id LIKE '%#{q}%' or movies.title '%#{q}%'")
      @streams = @streams.where("id like '%#{q}%'")
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "streams".* FROM "streams" INNER JOIN "movies" ON "movies"."id" = "streams"."movie_id" WHERE "streams"."user_id" = ? AND (id LIKE '%r%' or movies.title '%r%')  [["user_id", 10]]